---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor(Autodesk.Revit.DB.DirectShapeReferenceOptions)
source: html/61f1ba91-f76a-15b0-bb78-9ae0bd9eb1b6.htm
---
# Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor Method

Constructs a new copy of the input DirectShapeRefOptions object.

## Syntax (C#)
```csharp
public DirectShapeReferenceOptions(
	DirectShapeReferenceOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectShapeReferenceOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null